const expect = require('chai').expect;
const truncate = require('../utils/strutils').truncate;

describe('Обрезание строк', () => {
    describe('Невалидная строка', () => {
        it('undefined пропускается', () => {
            expect(truncate(undefined)).to.equal('');
        });

        it('null пропускается', () => {
            expect(truncate(null)).to.equal('');
        });
    });


    describe('Короткая строка', () => {
        it('остается без изменений', () => {
            expect(truncate('короткая строка')).to.equal('короткая строка');
        });
    });

    describe('Длинная строка ', () => {
        it('без пробелов обрезается на последней позиции и содержит ...', () => {
            expect(truncate('12345678901234567890123456789012345678901234567890123'))
            .to
            .equal('1234567890123456789012345678901234567890123456789 ...');
            
        });

        it('с пробелами обрезается на последнем пробеле и содержит ...', () => {
            expect(truncate('1234567890123456789012345678901234567890123 567 901 3'))
            .to
            .equal('1234567890123456789012345678901234567890123 567 ...');
            
        });
    });
});